[
    {"name": "Potion of Healing",
    "price": "50 gp",
    "description": "You regain 2d4 + 2 hit points when you drink this potion. The potion's red liquid glimmers when agitated.",
    "rarity": "Common"
    },
    {
        "name": "Potion of Greater Healing",
        "price": "150 gp",
        "description": "You regain 4d4 + 4 hit points when you drink this potion. The potion's red liquid glimmers when agitated.",
        "rarity": "Uncommon"
      },
      {
        "name": "Potion of Superior Healing",
        "price": "450 gp",
        "description": "You regain 8d4 + 8 hit points when you drink this potion. The potion's red liquid glimmers when agitated.",
        "rarity": "Rare"
      },
      {
        "name": "Potion of Supreme Healing",
        "price": "1,350 gp",
        "description": "You regain 10d4 + 20 hit points when you drink this potion. The potion's red liquid glimmers when agitated.",
        "rarity": "Very Rare"
      },
      {
        "name": "Potion of Animal Friendship",
        "price": "200 gp",
        "description": "When you drink this potion, you can cast the animal friendship spell (save DC 13) for 1 hour at will. Agitating this muddy liquid brings little bits into view: a fish scale, a hummingbird tongue, a cat claw, or a squirrel hair.",
        "rarity": "Uncommon"
      },
      {
        "name": "Potion of Clairvoyance",
        "price": "900 gp",
        "description": "When you drink this potion, you gain the effect of the clairvoyance spell. An eyeball bobs in this yellowish liquid but vanishes when the potion is opened.",
        "rarity": "Rare"
      },
      {
        "name": "Potion of Climbing",
        "price": "180 gp",
        "description": "When you drink this potion, you gain a climbing speed equal to your walking speed for 1 hour. During this time, you have advantage on Strength (Athletics) checks you make to climb. The potion is separated into brown, silver, and gray layers resembling bands of stone. Shaking the bottle fails to mix the colors.",
        "rarity": "Common"
      },
      {
        "name": "Potion of Diminution",
        "price": "270 gp",
        "description": "When you drink this potion, you gain the \"reduce\" effect of the enlarge/reduce spell for 1d4 hours (no concentration required). The red in the potion's liquid continuously contracts to a tiny bead and then expands to color the clear liquid around it. Shaking the bottle fails to interrupt this process.",
        "rarity": "Rare"
      },
      {
        "name": "Potion of Flying",
        "price": "500 gp",
        "description": "When you drink this potion, you gain a flying speed equal to your walking speed for 1 hour and can hover. If you're in the air when the potion wears off, you fall unless you have some other means of staying aloft. This potion's clear liquid floats at the top of its container and has cloudy white impurities drifting in it.",
        "rarity": "Very Rare"
      },
      {
        "name": "Potion of Gaseous Form",
        "price": "300 gp",
        "description": "When you drink this potion, you gain the effect of the gaseous form spell for 1 hour (no concentration required) or until you end the effect as a bonus action. This potion's container seems to hold fog that moves and pours like water.",
        "rarity": "Rare"
      },
      {
        "name": "Potion of Giant Strength",
        "price": "Varies",
        "description": "When you drink this potion, your Strength score changes for 1 hour. The type of giant determines the score (see below). The potion has no effect on you if your Strength is equal to or greater than that score. Hill Giant Strength (21): 200 gp, Frost/Stone Giant Strength (23): 400 gp, Fire Giant Strength (25): 800 gp, Cloud Giant Strength (27): 1,600 gp, Storm Giant Strength (29): 3,200 gp",
        "rarity": "Varies (Uncommon to Legendary)"
      },
      {
        "name": "Potion of Growth",
        "price": "270 gp",
        "description": "When you drink this potion, you gain the \"enlarge\" effect of the enlarge/reduce spell for 1d4 hours (no concentration required). The red in the potion's liquid continuously expands from a tiny bead to color the clear liquid around it and then contracts. Shaking the bottle fails to interrupt this process.",
        "rarity": "Uncommon"
      },
      {
        "name": "Potion of Heroism",
        "price": "180 gp",
        "description": "For 1 hour after drinking it, you gain 10 temporary hit points that last for 1 hour. For the same duration, you are under the effect of the bless spell (no concentration required). This blue potion bubbles and steams as if boiling.",
        "rarity": "Rare"
      },
      {
        "name": "Potion of Invisibility",
        "price": "180 gp",
        "description": "This potion's container looks empty but feels as though it holds liquid. When you drink it, you become invisible for 1 hour. Anything you wear or carry is invisible with you. The effect ends early if you attack or cast a spell.",
        "rarity": "Very Rare"
      },
      {
        "name": "Potion of Mind Reading",
        "price": "180 gp",
        "description": "When you drink this potion, you gain the effect of the detect thoughts spell (save DC 13). The potion's dense, purple liquid has an ovoid cloud of pink floating in it.",
        "rarity": "Rare"
      },
      {
        "name": "Potion of Poison",
        "price": "100 gp",
        "description": "This concoction looks, smells, and tastes like a potion of healing or other beneficial potion. However, it is actually poison masked by illusion magic. An identify spell reveals its true nature. If you drink it, you take 3d6 poison damage, and you must succeed on a DC 13 Constitution saving throw or be poisoned. At the start of each of your turns while you are poisoned in this way, you take 3d6 poison damage. At the end of each of your turns, you can repeat the saving throw. On a successful save, the poison damage you take on your subsequent turns decreases by 1d6. The poison ends when the damage decreases to 0.",
        "rarity": "Uncommon"
      },
      {
        "name": "Potion of Resistance",
        "price": "300 gp",
        "description": "When you drink this potion, you gain resistance to one type of damage for 1 hour. The DM chooses the type or determines it randomly from the options below: 1-2: Acid, 3-4: Cold, 5-6: Fire, 7-8: Force, 9-10: Lightning, 11-12: Necrotic, 13-14: Poison, 15-16: Psychic, 17-18: Radiant, 19-20: Thunder",
        "rarity": "Uncommon"
      },
      {
        "name": "Potion of Speed",
        "price": "400 gp",
        "description": "When you drink this potion, you gain the effect of the haste spell for 1 minute (no concentration required). The potion's yellow fluid is streaked with black and swirls on its own.",
        "rarity": "Very Rare"
      },
      {
        "name": "Potion of Water Breathing",
        "price": "180 gp",
        "description": "You can breathe underwater for 1 hour after drinking this potion. Its cloudy green fluid smells of the sea and has a jellyfish-like bubble floating in it.",
        "rarity": "Uncommon"
      },
      {
        "name": "Elixir of Health",
        "price": "120 gp",
        "description": "When you drink this potion, it cures any disease afflicting you, and it removes the blinded, deafened, paralyzed, and poisoned conditions. The clear red liquid has tiny bubbles of light in it.",
        "rarity": "Rare"
      },
      {
        "name": "Oil of Etherealness",
        "price": "1,920 gp",
        "description": "Beads of this cloudy gray oil form on the outside of its container and quickly evaporate. The oil can cover a Medium or smaller creature, along with the equipment it's wearing and carrying (one additional vial is required for each size category above Medium). Applying the oil takes 10 minutes. The affected creature then gains the effect of the etherealness spell for 1 hour.",
        "rarity": "Rare"
      },
      {
        "name": "Philter of Love",
        "price": "90 gp",
        "description": "The next time you see a creature within 10 minutes after drinking this philter, you become charmed by that creature for 1 hour. If the creature is of a species and gender you are normally attracted to, you regard it as your true love while you are charmed. This potion's rose-hued, effervescent liquid contains one easy-to-miss bubble shaped like a heart.",
        "rarity": "Uncommon"
      }
    

]