[
    {
        "name": "Staff of the Python",
        "price": "2,000 gp",
        "description": "You can use an action to speak this staff's command word and throw the staff on the ground within 10 feet of you. The staff becomes a giant constrictor snake under your control and acts on its own initiative count. By using a bonus action to speak the command word again, you return the staff to its normal form in a space formerly occupied by the snake.",
        "rarity": "Uncommon"
    },
    {
        "name": "Staff of the Adder",
        "price": "1,800 gp",
        "description": "You can use a bonus action to speak this staff's command word and make the head of the staff become that of an animate poisonous snake for 1 minute. By using another bonus action to speak the command word again, you return the staff to its normal inanimate form.",
        "rarity": "Uncommon"
    },
    {
        "name": "Staff of Charming",
        "price": "12,000 gp",
        "description": "While holding this staff, you can use an action to expend 1 of its 10 charges to cast charm person, command, or comprehend languages from it using your spell save DC. The staff can also be used as a magic quarterstaff.",
        "rarity": "Rare"
    },
    {
        "name": "Staff of Healing",
        "price": "13,000 gp",
        "description": "This staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability modifier: cure wounds (1 charge per spell level, up to 4th), lesser restoration (2 charges), or mass cure wounds (5 charges).",
        "rarity": "Rare"
    },
    {
        "name": "Staff of Swarming Insects",
        "price": "16,000 gp",
        "description": "This staff has 10 charges and regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, a swarm of insects consumes and destroys the staff, then disperses.",
        "rarity": "Rare"
    },
    {
        "name": "Staff of Withering",
        "price": "3,000 gp",
        "description": "This staff has 3 charges and regains 1d3 expended charges daily at dawn. The staff can be wielded as a magic quarterstaff. On a hit, it deals damage as a normal quarterstaff, and you can expend 1 charge to deal an extra 2d10 necrotic damage to the target.",
        "rarity": "Rare"
    },
    {
        "name": "Staff of the Woodlands",
        "price": "44,000 gp",
        "description": "This staff can be wielded as a magic quarterstaff that grants a +2 bonus to attack and damage rolls made with it. While holding it, you have a +2 bonus to spell attack rolls.",
        "rarity": "Rare"
    },
    {
        "name": "Staff of Fire",
        "price": "16,000 gp",
        "description": "You have resistance to fire damage while you hold this staff. The staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: burning hands (1 charge), fireball (3 charges), or wall of fire (4 charges).",
        "rarity": "Very Rare"
    },
    {
        "name": "Staff of Frost",
        "price": "26,000 gp",
        "description": "You have resistance to cold damage while you hold this staff. The staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: cone of cold (5 charges), fog cloud (1 charge), ice storm (4 charges), or wall of ice (4 charges).",
        "rarity": "Very Rare"
    },
    {
        "name": "Staff of Power",
        "price": "95,000 gp",
        "description": "This staff can be wielded as a magic quarterstaff that grants a +2 bonus to attack and damage rolls made with it. While holding it, you gain a +2 bonus to Armor Class, saving throws, and spell attack rolls.",
        "rarity": "Very Rare"
    },
    {
        "name": "Staff of Striking",
        "price": "21,000 gp",
        "description": "This staff can be wielded as a magic quarterstaff that grants a +3 bonus to attack and damage rolls made with it. The staff has 10 charges. When you hit with a melee attack using it, you can expend up to 3 of its charges. For each charge you expend, the target takes an extra 1d6 force damage.",
        "rarity": "Very Rare"
    },
    {
        "name": "Staff of Thunder and Lightning",
        "price": "10,000 gp",
        "description": "This staff can be wielded as a magic quarterstaff that grants a +2 bonus to attack and damage rolls made with it. It also has the following additional properties. When one of these properties is used, it can't be used again until the next dawn.",
        "rarity": "Very Rare"
    },
    {
        "name": "Staff of the Magi",
        "price": "250,000 gp",
        "description": "This staff can be wielded as a magic quarterstaff that grants a +2 bonus to attack and damage rolls made with it. While you hold it, you gain a +2 bonus to spell attack rolls.",
        "rarity": "Legendary"
    }

]